-- SELECT * FROM "Н_ГРУППЫ_ПЛАНОВ";
--
-- SELECT * FROM "Н_ПЛАНЫ";
--
-- SELECT * FROM "Н_ФОРМЫ_ОБУЧЕНИЯ";
--
-- select "НАЧАЛО" from "Н_УЧЕНИКИ";

--запрос 6
-- SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", /*ИЛИ Н_ЛЮДИ.ИНН Я НЕ ЗНАЮ*/ "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
-- FROM "Н_УЧЕНИКИ" INNER JOIN "Н_ЛЮДИ" ON ("Н_ЛЮДИ"."ИД" == "Н_УЧЕНИКИ"."ЧЛВК_ИД")
-- WHERE ("Н_УЧЕНИКИ"."НАЧАЛО" > '2012-01-09'::timestamp) AND EXISTS (/*ПОДЗАПРОС*/);

SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД", COUNT("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА") FROM "Н_ГРУППЫ_ПЛАНОВ"
    JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
    WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
    GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
    HAVING COUNT("Н_ГРУППЫ_ПЛАНОВ"."ГРУППА") = 2;